
export default {
    // 电话号码
    tel : /^1[3|4|5|7|8][0-9]{9}$/,
    // 邮箱
    email : /^(\w)+(\.\w+)*@(\w)+((\.\w+)+)$/,
    // 身份证
    certificate : /^(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)$/,
    // 银行卡
    checkBankCard : /^\d{15}|\d{20}$/,
    // 区号
    areaCode : /^0\d{2,3}$/,
    // 只能输入数字
    mustnum : /^\d+$/,
    // 验证码
    securityCode : /^\d{6}$/,
    // 邮政编码
    zipCode : /^\d{6}$/,
    // 密码
    psw : /^(\w){6,20}$/,
    // 固定电话 或 手机号
    telOrPhone : /^(0[0-9]{2,3}\-)?([2-9][0-9]{6,7})+(\-[0-9]{1,4})?$/,
    // 中文
    zhCN : /^[\u4e00-\u9fa5]+$/,
    // 最多输入20个字符(类型包括字母/数字/汉字)
    symbolfont20 : /^[A-Za-z0-9\u4e00-\u9fa5]{0,20}$/,
}